Revit 2024 API
ExtrusionAnalyzer Members
The ExtrusionAnalyzer type exposes the following members.
Methods
Name | Description
CalculateFaceAlignment
 Calculates the alignment status of each face of the solid.
Create
 Creates an ExtrusionAnalyzer and computes and stores the solid's shadow.
Dispose
Releases all resources used by the ExtrusionAnalyzer
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetExtrusionBase
 Obtains the face that represents the base contour of the extrusion analysis.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
EndParameter
 The end parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
ExtrusionDirection
 The direction of extrusion specified for the extrusion analysis.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StartParameter
 The start parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
See Also
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace